### Importar dataset

In [10]:
df <- read.csv("Data.csv")
df

   Country Age Salary Purchased
1  France  44  72000  No
2  Spain   27  48000  Yes
3  Germany 30  54000  No
4  Spain   38  61000  No
5  Germany 40     NA  Yes
6  France  35  58000  Yes
7  Spain   NA  52000  No
8  France  48  79000  Yes
9  Germany 50  83000  No
10 France  37  67000  Yes

### Tratar valores nulos

Se pueden tomar diferentes estrategias para manejar esta situación:
1. Eliminar las filas en las que se encuentran datos vacios. Una opción muy drástica y poco usada puesto que, al menos de que la fila venga vacía o casi, aún así aporta algo de información util para lo que estamos estudiando.
2. Sustituir los valores vacíos por medidas de localización de los datos, como la media, moda o mediana de la fila. Es la más usada y la que aprenderemos a hacer.

In [16]:
df$Age = ifelse(is.na(df$Age), mean(df$Age, na.rm = TRUE), df$Age)
df$Salary = ifelse(is.na(df$Salary), mean(df$Salary, na.rm = TRUE), df$Salary)

df

   Country Age      Salary   Purchased
1  France  44.00000 72000.00 No
2  Spain   27.00000 48000.00 Yes
3  Germany 30.00000 54000.00 No
4  Spain   38.00000 61000.00 No
5  Germany 40.00000 63777.78 Yes
6  France  35.00000 58000.00 Yes
7  Spain   38.77778 52000.00 No
8  France  48.00000 79000.00 Yes
9  Germany 50.00000 83000.00 No
10 France  37.00000 67000.00 Yes

### Tratar con datos categoricos

Para ambos casos se usa la función `factor()` de R, que convierte una variable en un factor. Un factor es una variable categórica que puede tomar un número limitado y fijo de valores. En este caso, la función `factor()` se usa para convertir las variables categóricas en factores, **lo que permite a R tratarlas como variables categóricas en lugar de numéricas**. Esto es útil para el análisis estadístico y la visualización de datos, ya que permite a R manejar correctamente las variables categóricas.

In [19]:
df$Country = factor(df$Country, levels = unique(df$Country), labels = 1:length(unique(df$Country)))
df$Purchased = factor(df$Purchased, levels = unique(df$Purchased), labels = 1:length(unique(df$Purchased)))
df

   Country Age      Salary   Purchased
1  1       44.00000 72000.00 1
2  2       27.00000 48000.00 2
3  3       30.00000 54000.00 1
4  2       38.00000 61000.00 1
5  3       40.00000 63777.78 2
6  1       35.00000 58000.00 2
7  2       38.77778 52000.00 1
8  1       48.00000 79000.00 2
9  3       50.00000 83000.00 1
10 1       37.00000 67000.00 2

### Dividr el dataframe en conjuntos de entrenamiento y testeo

In [27]:
library(caTools)

split = sample.split(df$Purchased, SplitRatio = 0.8)
training_set = subset(df, split == TRUE)
test_set = subset(df, split == FALSE)

training_set

   Country Age      Salary   Purchased
1  1       44.00000 72000.00 1
4  2       38.00000 61000.00 1
5  3       40.00000 63777.78 2
6  1       35.00000 58000.00 2
7  2       38.77778 52000.00 1
8  1       48.00000 79000.00 2
9  3       50.00000 83000.00 1
10 1       37.00000 67000.00 2

In [28]:
test_set

  Country Age Salary Purchased
2 2       27  48000  2
3 3       30  54000  1

### Escalar datos

In [30]:
training_set[, 2:3] = scale(training_set[, 2:3])
test_set[, 2:3] = scale(test_set[, 2:3])

training_set

   Country Age        Salary       Purchased
1  1        0.4902310  0.477099958 1
4  2       -0.6185637 -0.566720944 1
5  3       -0.2489655 -0.303129807 2
6  1       -1.1729610 -0.851399372 2
7  2       -0.4748311 -1.420756228 1
8  1        1.2294274  1.141349623 2
9  3        1.5990257  1.520920860 1
10 1       -0.8033628  0.002635911 2

In [31]:
test_set

  Country Age        Salary     Purchased
2 2       -0.7071068 -0.7071068 2
3 3        0.7071068  0.7071068 1